import telebot
import config
import random
import time

bot = telebot.TeleBot(config.token)

badWords = ["пидор", "пидр", "пидар", "пидарас", "хуйло", "хуесос", "еблан", "ебланка", "ебланка", "ебанат", "ебанутый", "ебанутая", 
            "мразь", "мудак", "мудила", "мудозвон", "лох", "лошара", "сука", "сучка", "блядь", "блядина", "блядун", "блядунья",
            "гандон", "еблашка", "еблантяй", "еблантяйка", "ебланщина", "ебланщик", "ебланщица", "ебланыч", "ебланюга", "ебланюган",
            "уебище", "уебан", "уебанка", "уебанщик", "уебанщица", "уебаныш", "уебанюга", "уебанюган", "уебище", "тупой", "тупица",
            "опарыш", "опарышка", "опарышонок", "опарышенок", "опарышатина", "опарышатник", "опарышатница", "опарышаты",
            "долбоеб", "долбоебка", "долбоебина", "долбоебонок", "долбоебенок", "долбоебатина", "долбоебатник", "долбоебатница",
            "долбоебаты", "долбоебыч", "долбоебыш", "долбоебышка", "долбоебышонок", "долбоебышенок", "долбоебышатина", "долбоебышатник",
            "шлюха", "шалава", "шалавка", "шалавина", "шалавонок", "шалавенок", "шалаватина", "шалаватник", "шалаватница", "шалаваты",
            "ушлепок", "ушлепочка", "ушлепонок", "ушлепенок", "ушлепатина", "ушлепатник", "ушлепатница", "ушлепаты", "ушлепыч", "ушлепыш",
            "урылище", "тварь", "тварина", "тварюга", "тварюган", "тварюгонок", "тварюгенок", "тварюгатина", "тварюгатник", "тварюгатница",
            "крип", "крипа", "крипонок", "крипенок", "крипатина", "крипатник", "крипатница", "крипаты", "крипыч", "крипыш",
            "блядь", "блядина", "блядун", "блядунья", "блядушка", "блядушка", "блядушко", "блядушко", "блядушкин", "блядушкин", "блядушкина",
            "ебанутый", "свинья", "свинота"]

@bot.message_handler(commands=['start'])
def start_spam(message):
   for _ in range(10):
         random_word = random.choice(badWords)
         bot.send_message(message.chat.id, f"{random_word}")
         time.sleep(1) 

if __name__ == "__main__":
   bot.infinity_polling()






import telebot
import config
import random

bot = telebot.TeleBot(config.token)

badWords = ["пидор", "пидр", "пидар", "пидарас", "хуйло", "хуесос", "еблан", "ебланка", "ебланка", "ебанат", "ебанутый", "ебанутая", 
            "мразь", "мудак", "мудила", "мудозвон", "лох", "лошара", "сука", "сучка", "блядь", "блядина", "блядун", "блядунья",
            "гандон", "еблашка", "еблантяй", "еблантяйка", "ебланщина", "ебланщик", "ебланщица", "ебланыч", "ебланюга", "ебланюган",
            "уебище", "уебан", "уебанка", "уебанщик", "уебанщица", "уебаныш", "уебанюга", "уебанюган", "уебище", "тупой", "тупица",
            "опарыш", "опарышка", "опарышонок", "опарышенок", "опарышатина", "опарышатник", "опарышатница", "опарышаты",
            "долбоеб", "долбоебка", "долбоебина", "долбоебонок", "долбоебенок", "долбоебатина", "долбоебатник", "долбоебатница",
            "долбоебаты", "долбоебыч", "долбоебыш", "долбоебышка", "долбоебышонок", "долбоебышенок", "долбоебышатина", "долбоебышатник",
            "шлюха", "шалава", "шалавка", "шалавина", "шалавонок", "шалавенок", "шалаватина", "шалаватник", "шалаватница", "шалаваты",
            "ушлепок", "ушлепочка", "ушлепонок", "ушлепенок", "ушлепатина", "ушлепатник", "ушлепатница", "ушлепаты", "ушлепыч", "ушлепыш",
            "урылище", "тварь", "тварина", "тварюга", "тварюган", "тварюгонок", "тварюгенок", "тварюгатина", "тварюгатник", "тварюгатница",
            "крип", "крипа", "крипонок", "крипенок", "крипатина", "крипатник", "крипатница", "крипаты", "крипыч", "крипыш",
            "блядь", "блядина", "блядун", "блядунья", "блядушка", "блядушка", "блядушко", "блядушко", "блядушкин", "блядушкин", "блядушкина",
            "ебанутый", "свинья", "свинота"]

@bot.message_handler(commands=['start'])
def send_random_word(message):
   random_word = random.choice(badWords)
   bot.send_message(message.chat.id, f"{random_word}")



if __name__ == "__main__":
   bot.infinity_polling()



# @bot.message_handler(content_types=['stickers'])            #айдишник стикера
# def sticker_id(message):
#    sticker_id = message.sticker.file_id
#    print(f"Sticker ID: {sticker_id}")
#    bot.send_message(message.chat.id, "`{sticker_id}`", parse_mode="Markdown") 